Reactive1dTube/common/constant/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{          
    //solver            EulerImplicit;
    solver            ode;
    method            standard;
}

chemistry           on; 

initialChemicalTimeStep 1e-7;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

/*odeCoeffs
{
    solver          Rosenbrock34;
    absTol          1e-12;
    relTol          1e-2;
}*/

odeCoeffs
{
    solver          seulex;
    absTol          1e-8;
    relTol          1e-1;
}

// ************************************************************************* //
