Reactive1dTube/common/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"
    
    leftSide
    {
        type            noSlip;
    }

    rightSide
    {
        type            inletOutlet;
        inletValue      uniform (-487.34 0 0);
        value           uniform (-487.34 0 0);
    }

    emptyFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
