Reactive1dTube/common/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0;

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"
    
    leftSide
    {
        type            zeroGradient;
    }

    rightSide
    {
        //type            fixedValue;
        //value           uniform 747.71878;

        type            zeroGradient;
    }

    emptyFaces
    {
        type            empty;
    }
}

//************************************************************************* //
