Reactive1dTube/common/0.orig/rho
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      rho;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -3 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    //#includeEtc "caseDicts/setConstraintTypes"

    leftSide
    {
        type            zeroGradient;
    }

    rightSide
    {
        //type            fixedValue;
        //value           uniform 0.18075;

        type            zeroGradient;
    }

    emptyFaces
    {
        type            empty;
    }
}

// ************************************************************************* //
