Reactive1dTube/common/system/FOs/FOreactionSensitivityAnalysis
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Computes indicators for reaction rates of creation or destruction
    of species in each reaction.

Usage
    Usage by the postProcess utility is not available.

\*---------------------------------------------------------------------------*/

reactionsSensitivityAnalysis
{
    // Mandatory entries (unmodifiable)
    type            reactionSensitivityAnalysis;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    writePrecision  12;
    writeToFile     true;
    useUserTime     true;
    region          region0;
    enabled         true;
    log             true;
    timeStart       $tStartTime;
    timeEnd         $tEndTime;
    executeControl  timeStep;
    executeInterval 1;
    writeControl    writeTime;
    writeInterval   -1;
}


// ************************************************************************* //
