Reactive1dTube/common/system/FOs/FOwriteCellCentres
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writing the cell-centres volVectorField and the three component fields 
    as volScalarFields.

Usage
    Minimal example by using the \c postProcess utility:
    \verbatim
        postProcess -func writeCellCentres
    \endverbatim

\*---------------------------------------------------------------------------*/

writeCellCentres
{
    type            writeCellCentres;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       $tWriteObj;
    timeEnd         $tEndTime;
    executeControl  onEnd;
    executeInterval -1;
    writeControl    onEnd;
    writeInterval   -1;
}


// ************************************************************************* //
