Reactive1dTube/common/system/FOs/FOwriteCellVolumes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the cell-volumes volScalarField.

Usage
    Minimal example by using the \c postProcess utility:
    \verbatim
        postProcess -func writeCellVolumes
    \endverbatim

\*---------------------------------------------------------------------------*/

writeCellVolumes
{
    // Mandatory entries
    type            writeCellVolumes;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    region          region0;
    enabled         true;
    log             true;
    timeStart       $tWriteObj;
    timeEnd         $tEndTime;
    executeControl  onEnd;
    executeInterval -1;
    writeControl    onEnd;
    writeInterval   -1;
}


// ************************************************************************* //
