Reactive1dTube/common/system/FOs/FOwriteObjects
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out specified objects, e.g. fields, stored on the case database.

Usage
    Usage by the postProcess utility is not available.

\*---------------------------------------------------------------------------*/

writeObjects
{
    type            writeObjects;
    libs            (utilityFunctionObjects);

    objects         
    (
        banana //test
        //nu //add for FOresolutionIndex

        //thermo:mu
        //delta
        
        //tc
        
        //dot_omega(fuel)
        //RR.H2
        //RR.OH
        //RR.H2O
        //RR.HO2
    );

    enabled         true;
    timeStart       $tStartTime; //$tWriteObj;
    timeEnd         $tEndTime;
    writeControl    writeTime;
    writeOption     anyWrite;
}


// ************************************************************************* //
