Reactive1dTube/common/system/FOs/FOyPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Version:  v2212
    \\  /    A nd           | Website:  www.openfoam.com
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Computes the near wall \f$y_1^+\f$ for turbulence models

Usage
    Minimal example by using the \c postProcess utility:
    \verbatim
        <solver> -postProcess -func yPlus
    \endverbati

\*---------------------------------------------------------------------------*/

yPlus
{
    // Mandatory entries (unmodifiable)
    type            yPlus;
    libs            (fieldFunctionObjects);

    // Optional (inherited) entries
    writePrecision  12;
    writeToFile     true;
    useUserTime     true;

    region          region0;
    enabled         true;
    log             true;
    timeStart       $tTurFields;
    timeEnd         $tEndTime;

    writeFields     yes;
    executeControl  onEnd; //writeTime
    executeInterval -1;
    writeControl    onEnd; //writeTime
    writeInterval   -1;
}


// ************************************************************************* //
