Reactive1dTube/common/system/sample
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sample;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type sets;
libs            ("libsampling.so");

setFormat       raw;

interpolationScheme cell;

// Fields to sample.
fields
(
    T
    U
    gamma
    H
);

sets
(
    Centerline
    {
        type    cellCentre;
        axis    x;

        start   (0 0 0);
        end     (0.12 0 0);
    }
);


// ************************************************************************* //
